# WPerFt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..WPerFt Property
SymbolTypeId Class See Also
---
Symbol W/ft, indicating unit Watts per foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId WPerFt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WPerFt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WPerFt {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace